import numpy as np


def ep(Mz, T, a, i, e, w):
    
    '''
    M - масса экзопланеты (в массах Земли)
    R - радиус экзопланеты (в радиусах Земли)
    a - большая полуось (в а.е.)
    T - период обращения (в днях)
    i - наклонение (в градусах)
    e - эксцентриситет 
    w - аргумент перицентра (в градусах) 

    '''
    G = 6.672*10**-11
    #M = M*(5.974*10**24)
    #R = R*6378100
    #a = a*(149.6*10**9)
    T = T*24*60*60
    #T = np.sqrt(4*np.pi**2/(Mz*G)*a**3)
    a = ((T**2*G*Mz)/(4*np.pi**2))**(1/3)
    i = np.pi*i/180
    w = np.pi*w/180
    
    q = a*(1-e)
    v_q = np.sqrt(G*Mz/a)*np.sqrt((1+e)/(1-e))
    
    v_y = v_q*np.cos(i)
    v_z = v_q*np.sin(i)
    
    print(q/(149.6*10**9), a/(149.6*10**9),  v_q)
    

ep(120*10**24, 20, 3, 0, 0, 0)